experiments/results/logs/ramp-hpa-006/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7216.824ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 7463.239ms, rate sampling interval: 16547ms
  Thread calibration: mean lat.: 7375.339ms, rate sampling interval: 16637ms
  Thread calibration: mean lat.: 7709.818ms, rate sampling interval: 16564ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.21m     1.16m    4.24m    58.37%
    Req/Sec     3.47      0.50     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20m 
 75.000%    3.21m 
 90.000%    3.82m 
 99.000%    4.17m 
 99.900%    4.22m 
 99.990%    4.24m 
 99.999%    4.24m 
100.000%    4.24m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9101.311     0.000000            1         1.00
   38174.719     0.100000          457         1.11
   61243.391     0.200000          911         1.25
   84148.223     0.300000         1367         1.43
  109117.439     0.400000         1823         1.67
  131989.503     0.500000         2277         2.00
  144441.343     0.550000         2506         2.22
  156106.751     0.600000         2734         2.50
  168951.807     0.650000         2966         2.86
  180617.215     0.700000         3189         3.33
  192806.911     0.750000         3417         4.00
  198967.295     0.775000         3530         4.44
  206045.183     0.800000         3644         5.00
  213123.071     0.825000         3762         5.71
  218365.951     0.850000         3873         6.67
  224002.047     0.875000         3987         8.00
  227016.703     0.887500         4044         8.89
  229244.927     0.900000         4107        10.00
  231735.295     0.912500         4156        11.43
  234356.735     0.925000         4216        13.33
  237371.391     0.937500         4272        16.00
  238419.967     0.943750         4298        17.78
  239730.687     0.950000         4327        20.00
  242483.199     0.956250         4356        22.86
  243793.919     0.962500         4390        26.67
  244711.423     0.968750         4413        32.00
  245628.927     0.971875         4426        35.56
  246939.647     0.975000         4442        40.00
  247988.223     0.978125         4456        45.71
  248774.655     0.981250         4474        53.33
  249298.943     0.984375         4485        64.00
  249561.087     0.985938         4490        71.11
  250085.375     0.987500         4503        80.00
  250216.447     0.989062         4508        91.43
  250347.519     0.990625         4512       106.67
  250871.807     0.992188         4519       128.00
  251265.023     0.992969         4527       142.22
  251265.023     0.993750         4527       160.00
  251658.239     0.994531         4534       182.86
  251658.239     0.995313         4534       213.33
  251789.311     0.996094         4537       256.00
  251920.383     0.996484         4538       284.44
  252182.527     0.996875         4540       320.00
  252444.671     0.997266         4543       365.71
  252575.743     0.997656         4545       426.67
  252837.887     0.998047         4546       512.00
  252837.887     0.998242         4546       568.89
  253362.175     0.998437         4548       640.00
  253362.175     0.998633         4548       731.43
  253493.247     0.998828         4549       853.33
  253755.391     0.999023         4550      1024.00
  253755.391     0.999121         4550      1137.78
  253886.463     0.999219         4551      1280.00
  253886.463     0.999316         4551      1462.86
  254017.535     0.999414         4552      1706.67
  254017.535     0.999512         4552      2048.00
  254017.535     0.999561         4552      2275.56
  254279.679     0.999609         4553      2560.00
  254279.679     0.999658         4553      2925.71
  254279.679     0.999707         4553      3413.33
  254279.679     0.999756         4553      4096.00
  254279.679     0.999780         4553      4551.11
  254672.895     0.999805         4554      5120.00
  254672.895     1.000000         4554          inf
#[Mean    =   132692.955, StdDeviation   =    69379.878]
#[Max     =   254541.824, Total count    =         4554]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4656 requests in 5.00m, 47.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 10304
Requests/sec:     15.51
Transfer/sec:    162.95KB